onvif-api/src/main/xml/example.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" targetNamespace="http://www.onvif.org/ver10/device/wsdl">
 <wsdl:portType name="Device">
  <wsdl:operation name="GetDeviceInformation" />
  <wsdl:operation name="GetSystemDateAndTime" />
  <wsdl:operation name="GetCapabilities" />
 </wsdl:portType>
</wsdl:definitions>
