ONVIF/GetDeviceInformation-auth.xml

<?xml version='1.0' encoding='utf-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
	<SOAP-ENV:Body>
		<tds:GetDeviceInformation/>
	</SOAP-ENV:Body>
	<SOAP-ENV:Header>
		<Security SOAP-ENV:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<UsernameToken>
				<Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2022-11-22T11:09:55.000Z</Created>
				<Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">BR7ZGBFpmYJ0SMFN0/ma2ycsfpE=</Nonce>
				<Username>admin</Username>
				<Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">zNMuqmCZ4bKp+97lCt+emt4Nc7I=</Password>
			</UsernameToken>
		</Security>
	</SOAP-ENV:Header>
</SOAP-ENV:Envelope>
