indoor/app/layout/resource/onvif/getsystemdateAndTime.xml

POST /onvif/device_service HTTP/1.1
Content-Type: application/soap+xml; charset=utf-8;
action="http://www.onvif.org/ver10/device/wsdl/GetSystemDateAndTime"
Host: %s
Content-Length: 295
Accept-Encoding: gzip, deflate
Connection: Close

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <GetSystemDateAndTime xmlns="http://www.onvif.org/ver10/device/wsdl" />
    </s:Body>
</s:Envelope>